# Views in SQL

Â© Explore Data Science Academy

## Learning Objectives

In this train, we will learn how to:

- Define and describe what views are;
- Understand the function of a view in SQL relational databases;
- Distinguish between different types of views in SQL relational databases; and
- Create views using SQL.

## Outline

To meet our objectives, this train is structured as follows:

- Train dependencies.
- Views: What is a view and why are they necessary?
- Exploring and creating different view types.
- Dropping a view.
- Best practices for setting up a view.
- Practice questions.
- Conclusion
- Appendix

#### A quick note:

Within this train we will make several changes to our underlying dataset. If at any point you wish to reset these changes, please run the following SQL query: 

```SQL
DROP VIEW Customer_Germany;
DROP VIEW Customer_Support_View;
DROP VIEW Customer_View;
DROP VIEW Customer_per_Country_View;
DROP VIEW Employee_View;
DROP VIEW Support_Person_Stats;
```

## Views: What is a 'view' and why are they necessary?

In SQL, you may have hundreds of tables all linking up with each other. Some or most of the data they contain many not necessarily be informative. This results in complex queries which are needed to extract the informative parts. The underlying complexity also makes it difficult to navigate through all of the database and its multiple relationships.

Bearing this dilemma in mind, imagine suddenly that you are on holiday and need to take a photograph of the beautiful landscape you find yourself in. Now unfortunately you can't take a 360-degree photo, which is possibly a good thing as you might want to omit certain aspects that don't make the photo as appealing as you would like. Instead, you would need to frame the photo for the best possible view that captures the landscape. 

We observe that an analogous process can be achieved in SQL. Just as we could frame our view of the landscape, a view in SQL allows a user to view a snapshot of selected data from a table or many tables - presenting only desired information while hiding the underlying complexity/scale of the full dataset. 

Formally speaking, a view is a virtual table that is created within SQL which does not hold any physical storage. Rather, it is stored under "data dictionary" memory. A view is similar to a table with regards to how it can be constructed. Furthermore, like tables you can apply many functions to a view such as joins, aggregative operations and filtering.

Below is a diagram showing how two tables (employee table & customer table) can be filtered to select certain columns of the data. The view (the table on the right) shows the columns deemed important from the two tables.

![SQL Views Introduction](https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/View_intro.jpg?raw=true)

So if we have the tables, why not just write all the queries and save their results as a new summarised table that can be accessed later?

To understand why this is a bad idea, its important to note that tables in SQL can permanently occupy physical memory and influence the underlying schema of the database. This introduces problems of _complexity_ and _security access_. 

A view address these problems with its <b>two main functions</b>, namely:

1. Reducing and/or hiding complexity.
2. Controlling security access to the database.

A view can _reduce and/or hide complexity_ by combining queries needed to summarise data and make it accessible in a quick manner. Furthermore, by not affecting the underlying schema of the database, there is not need to further normalise the data or create new relationship fields - saving precious time which could be spent elsewhere.  

To grasp the second main function of a view, imagine again that you're in a hypothetical scenario where you have admin access to important customer data on a database that is also sensitive. Here, in order to keep this data safe, you might want someone else working on the database to only be able to explore non-confidential aspects of the data, while other tables are restricted. A view allows the administrator to _control security access of the database_ by only allowing a view of certain selected data.

## Exploring Views and Different View Types

With some intuition under our belts, in this section, you will get the opportunity to see how views can be created and dropped. You will also get to see the different types of views used in practice.

#### Let's get an overview of the database

In [1]:
#Load the SQL extension to use magic commands.
%load_ext sql

In [2]:
# Load SQLite database
%sql sqlite:///chinook.db

Below are all the different tables in the database:

In [3]:
%%sql

SELECT name FROM sqlite_master WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///chinook.db
Done.

[('albums',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoice_items',),
 ('invoices',),
 ('media_types',),
 ('playlist_track',),
 ('playlists',),
 ('tracks',)]

As a refresher, lets have a quick look at the data within the 'Employees' and 'customers' tables:

In [4]:
%%sql

SELECT * FROM Employees
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

Remember that the `LIMIT` keyword restricts the number of results returned from our queries to make them more readable.

In [5]:
%%sql

SELECT * FROM customers
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(1, 'LuÃ­s', 'GonÃ§alves', 'Embraer - Empresa Brasileira de AeronÃ¡utica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'SÃ£o JosÃ© dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'KÃ¶hler', None, 'Theodor-Heuss-StraÃe 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'FranÃ§ois', 'Tremblay', None, '1498 rue BÃ©langer', 'MontrÃ©al', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'BjÃ¸rn', 'Hansen', None, 'UllevÃ¥lsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'FrantiÅ¡ek', 'WichterlovÃ¡', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

### CREATE a View

Let's quickly focus on the syntax used to create a view. 

Use the `CREATE VIEW` SQL command to set up a view. Your syntax will be as follows:

```CREATE VIEW```    _ViewName_ ```AS``` <br>
```SELECT```         _column_names_ <br>
```FROM```           _table_name_; <br>

Let's give this a try:

In [6]:
%%sql

CREATE VIEW Customer_View AS                 
SELECT FirstName, LastName, Company, Email
FROM customers ;

 * sqlite:///chinook.db
Done.

[]

In [7]:
%%sql

SELECT * FROM Customer_View
LIMIT 10;

 * sqlite:///chinook.db
Done.

[('LuÃ­s', 'GonÃ§alves', 'Embraer - Empresa Brasileira de AeronÃ¡utica S.A.', 'luisg@embraer.com.br'),
 ('Leonie', 'KÃ¶hler', None, 'leonekohler@surfeu.de'),
 ('FranÃ§ois', 'Tremblay', None, 'ftremblay@gmail.com'),
 ('BjÃ¸rn', 'Hansen', None, 'bjorn.hansen@yahoo.no'),
 ('FrantiÅ¡ek', 'WichterlovÃ¡', 'JetBrains s.r.o.', 'frantisekw@jetbrains.com'),
 ('Helena', 'HolÃ½', None, 'hholy@gmail.com'),
 ('Astrid', 'Gruber', None, 'astrid.gruber@apple.at'),
 ('Daan', 'Peeters', None, 'daan_peeters@apple.be'),
 ('Kara', 'Nielsen', None, 'kara.nielsen@jubii.dk'),
 ('Eduardo', 'Martins', 'Woodstock Discos', 'eduardo@woodstock.com.br')]

## Different types of Views

There are three different types of views available in SQL: 

- Look Up View
- Join View
- Aggregating View

We'll investigate these respectively within the sections below.

### Look Up View

A look up view allows the user to select a certain number of columns from a single table. 

Below is a diagram of a view being created from selected columns in a table. In a hypothetical situation regarding bank account details, we might want to only look at specific variables/columns in the data. For example, we are only interested in the account number ("Acc. #"), "Surname" and "Name" of a particular customer. Our view would look similar to the diagram below.

![SQL Look Up View](https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/lookup_view.jpg?raw=true)

#### Here are some practical examples of a Look Up View using the Chinook database.

In [8]:
%%sql

CREATE VIEW Employee_View AS 
SELECT LastName, FirstName, Title, Country
FROM Employees

 * sqlite:///chinook.db
Done.

[]

As defined above, we might only be required to view the surname, first name, title and country of an employee. Our view would then look like the following:

In [9]:
%%sql 

SELECT * FROM Employee_View

 * sqlite:///chinook.db
Done.

[('Adams', 'Andrew', 'General Manager', 'Canada'),
 ('Edwards', 'Nancy', 'Sales Manager', 'Canada'),
 ('Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Johnson', 'Steve', 'Sales Support Agent', 'Canada'),
 ('Mitchell', 'Michael', 'IT Manager', 'Canada'),
 ('King', 'Robert', 'IT Staff', 'Canada'),
 ('Callahan', 'Laura', 'IT Staff', 'Canada')]

A view can also be filtered. For instance, we might want to see the sales team, so we can use the wildcard operators and the `LIKE` query to filter all the employees in the specified view:

In [10]:
%%sql

SELECT * FROM Employee_View
WHERE Title LIKE '%Sales%'

 * sqlite:///chinook.db
Done.

[('Edwards', 'Nancy', 'Sales Manager', 'Canada'),
 ('Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Johnson', 'Steve', 'Sales Support Agent', 'Canada')]

### Join View

A join view comprises of two or more tables that have a relationship through a key where a ```JOIN``` statement can be implemented. A join view can display selected variables/columns from multiple tables at once. 

Below is a diagram illustrating the join view. Here, for example, we have a customers table containing all the personal data of store patrons (Table 1), and another table with corresponding customer account details (Table 2). We might only want to see a customer's surname, account number ("Acc. #") and a balance in their account (assuming a credit balance). 

To do this, we would create a view in conjunction with  ```SELECT``` and ```JOIN``` statements.

![SQL Join View](https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/join_view.jpg?raw=true)

#### Here is an example of creating a Join view using the Chinook Database.

Let's say we want to link up all the customers with the support staff assisting them. We want to view the following:

- First of the customer.
- Last name (surname) of the customer.
- The country where the customer resides.
- SupportRepId.
- EmployeeId.
- Last name of the employee.
- FirstName of the employee.
- Job title of the employee. 
- The country where the employee operated from.

In [11]:
%%sql

CREATE VIEW Customer_Support_View AS
SELECT c.FirstName Customer_Name, c.LastName Customer_Surname, c.Country Customer_Country, c.SupportRepId, e.EmployeeId, e.LastName Employee_surname, e.FirstName Employee_first_name, e.Title Employee_job_title, e.Country Employee_Country
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId

 * sqlite:///chinook.db
Done.

[]

In [12]:
%%sql

SELECT * FROM Customer_Support_View
LIMIT 10

 * sqlite:///chinook.db
Done.

[('LuÃ­s', 'GonÃ§alves', 'Brazil', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Leonie', 'KÃ¶hler', 'Germany', 5, 5, 'Johnson', 'Steve', 'Sales Support Agent', 'Canada'),
 ('FranÃ§ois', 'Tremblay', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('BjÃ¸rn', 'Hansen', 'Norway', 4, 4, 'Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('FrantiÅ¡ek', 'WichterlovÃ¡', 'Czech Republic', 4, 4, 'Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Helena', 'HolÃ½', 'Czech Republic', 5, 5, 'Johnson', 'Steve', 'Sales Support Agent', 'Canada'),
 ('Astrid', 'Gruber', 'Austria', 5, 5, 'Johnson', 'Steve', 'Sales Support Agent', 'Canada'),
 ('Daan', 'Peeters', 'Belgium', 4, 4, 'Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Kara', 'Nielsen', 'Denmark', 4, 4, 'Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Eduardo', 'Martins', 'Brazil', 4, 4, 'Park', 'Margaret', 'Sales Support Agent', 'Canada')]

Tada!

### Aggregating View

An aggregating view utilises summary metrics (such as average, median, count, etc.) to create a column within the view that aggregates the data. An aggregating view is useful when you need to select parts of a table with summary statistics describing the data. 

Below is a diagram illustrating an aggregating view. Here we once again suppose a hypothetical scenario where we need to get an average of customers' balance (assuming a credit balance), where there are multiple inputs of transactional recordings. To do this we create a view with a column of the average of the balance, and group by the customer id. 

![SQL Aggregate View](https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/agg_view.jpg?raw=true)

#### Below are some practical examples of an aggregating view. 

In the example below, we intend on investigating how many customers are currently being serviced per country. 

To create the view, we would use the following SQL query:

In [13]:
%%sql

CREATE VIEW Customer_per_Country_View AS 
SELECT COUNT (CustomerId), Country
FROM customers
GROUP BY Country;

 * sqlite:///chinook.db
Done.

[]

This gives us:

In [15]:
%%sql

SELECT * FROM Customer_per_Country_View
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'Argentina'),
 (1, 'Australia'),
 (1, 'Austria'),
 (1, 'Belgium'),
 (5, 'Brazil'),
 (8, 'Canada'),
 (1, 'Chile'),
 (2, 'Czech Republic'),
 (1, 'Denmark'),
 (1, 'Finland')]

In the next example, we will explore how to combine an aggregating view and join view. 

In this scenario, we want to investigate how many customers each support employee services, along with the name of the employee. 

To do this we would need to:
- Create a view.
- Join the customer table and employee table.
- Use ```COUNT``` and ```GROUP BY``` functions to aggregate the number of employees serviced by each employee. 

The SQL query would look as follows:

In [16]:
%%sql

CREATE VIEW Support_Person_Stats AS
SELECT COUNT(c.SupportRepId) Count_of_Customers_Serviced , e.EmployeeId, e.LastName
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId
GROUP BY e.Lastname

 * sqlite:///chinook.db
Done.

[]

In [17]:
%%sql

SELECT * FROM Support_Person_Stats

 * sqlite:///chinook.db
Done.

[(18, 5, 'Johnson'), (20, 4, 'Park'), (21, 3, 'Peacock')]

## DROP a View

In many cases, you will need to delete a view either before creating a new one, or when there are changes to the schema of the database. In these scenarios, it is best practice to delete and remake a view, rather than changing an existing one. This corrects and accounts for any security and/or complexity changes.

Use the `DROP` query to drop a view created. Your syntax will be as follows:

```SQL
DROP VIEW _view_name_
```

Let's practice this dropping a bit:

In [18]:
%%sql

CREATE VIEW mistake_view AS 
SELECT FirstName, LastName, Company, Email
FROM customers

 * sqlite:///chinook.db
Done.

[]

In [19]:
%%sql

DROP VIEW mistake_view

 * sqlite:///chinook.db
Done.

[]

In [20]:
%%sql

SELECT * FROM mistake_view

 * sqlite:///chinook.db
(sqlite3.OperationalError) no such table: mistake_view
[SQL: SELECT * FROM mistake_view]
(Background on this error at: http://sqlalche.me/e/e3q8)

From the output error above, we can see that our created view was successfully removed from the database.

## Best Practices when Creating Views

Below are some guidelines and standards when dealing with views within a database:

- The tables used to create the view must be from the same relational database.
- A view must differ at some level to the table it is referencing or any other table in the database.
- The order of the columns should be logically coherent, mirroring the sequence of its constituent table/tables.
- The naming convention of a view needs to differ from all other tables but should also reflect the data it presents.
- A view should be deleted rather than updated to ensure that complexity and security issues for the database are addressed.

---

## Practice Questions

You now have the opportunity to test your understanding of views with some practical questions!

If you need to restart the exercise, run the following code:

```SQL
%%sql

DROP VIEW <view_name>
```

Ready... Set... EXPLORE!!!

We first overview some data from the 'invoice_items' and 'invoices' tables:

In [21]:
%%sql

SELECT * FROM invoice_items
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 1, 2, 0.99, 1),
 (2, 1, 4, 0.99, 1),
 (3, 2, 6, 0.99, 1),
 (4, 2, 8, 0.99, 1),
 (5, 2, 10, 0.99, 1),
 (6, 2, 12, 0.99, 1),
 (7, 3, 16, 0.99, 1),
 (8, 3, 20, 0.99, 1),
 (9, 3, 24, 0.99, 1),
 (10, 3, 28, 0.99, 1)]

In [23]:
%%sql

SELECT * FROM invoices
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-StraÃe 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'UllevÃ¥lsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'GrÃ©trystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger StraÃe 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'BarbarossastraÃe 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (9, 42, '2009-02-02 00:00:00', '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', 3.96),
 (10, 46, '2009-02-03 00:00:00', '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, 5.94)]

### Question 1: 

Your manager needs to present details from the Chinook database to new clients. However, she is wary of releasing too much information. She has requested a few tasks to be completed using the "invoices" table, where all customer invoices need to be assessed:

1. She would like to view the invoice date, billing city, billing country and the total spent on each invoice. Set up a view called "Billing_View" to display these specific columns only.
2. She would then need to get a view on the average spending for each country. She only wants to see the billing country and the aggregated average total amount spent. Set up a view called "Billing_View_per_Country" to display these averages.
3. She is also interested in seeing the most profitable years. She needs to see the years and the sum of the amount spent each year. Set up a view called "Yearly_Billing" to display the total spend for each year. HINT: use the "strftime" function to convert the invoice date.

In [24]:
# Answer Question 1.1 here

#### _Expected Outcome:_

<img src="https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/q1_1.png?raw=true" alt="drawing" width="400"/>

In [25]:
# Answer Question 1.2 here

#### _Expected Outcome:_

<img src="https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/q1_2.png?raw=true" alt="drawing" width="250"/>

In [26]:
# Answer Question 1.3 here

#### _Expected Outcome:_

<img src="https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/q1_3.png?raw=true" alt="drawing" width="250"/>

### Question 2: 

Your manager is satisfied with the first set of views you created - Horay! Unfortunately, she would like to go into the more granular detail of the customers and their spending. The final task requires you to link the "customers" table with the "invoices" table. She has asked for the following views:

2.1. The billing country stated on the invoice, the total spent on the invoice, the last name of each customer, and their country of residence. 
    - This view should only have the billing country, total spent, last name the customer and their country of residence as columns. Call this view "Customer_Billing_View".

2.2. The sum of the total amount spent by each customer in the latest year (2013). 
    - The view should only contain the customers' surname, the sum of the total invoice amount and the year as columns. Call this view "Customer_Billing_2013_View". 
    
Hint: the invoice date column should be treated as a string; use the "strftime" function.

In [27]:
#Answer Question 2.1 here

#### _Expected Outcome:_

<img src="https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/q2_1.png?raw=true" alt="drawing" width="350"/>

In [28]:
#Answer Question 2.2 here

#### _Expected Outcome:_

<img src="https://github.com/Explore-AI/Public-Data/blob/master/Notebook-images/q2_2.png?raw=true" alt="drawing" width="300"/>

## Conclusion

Views are useful when trying to display a snapshot of selected data from a database. They also come in handy when allowing certain columns to be accessed by a viewer. Views can be made from aggregations, joins and filtering; they can also be used in conjunction with multiple operations and commands. 

Till next time!

## Appendix

#### References:

- [Rules and guidelines for SQL views](https://docs.informatica.com/data-integration/powercenter/10-2/data-validation-option-user-guide/sql-views/rules-and-guidelines-for-sql-views.html)
- [Tutorial: Views in SQL](https://www.datacamp.com/community/tutorials/views-in-sql)